{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "google/bigbird-roberta-large",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 64,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "encoder.layer.23.intermediate.dense",
    "encoder.layer.19.attention.self.query",
    "encoder.layer.23.attention.self.key",
    "encoder.layer.10.attention.output.dense",
    "pooler",
    "encoder.layer.22.attention.output.dense",
    "encoder.layer.20.attention.output.dense",
    "encoder.layer.12.output.dense",
    "encoder.layer.1.attention.self.query",
    "encoder.layer.3.intermediate.dense",
    "encoder.layer.20.attention.self.value",
    "encoder.layer.5.output.dense",
    "encoder.layer.7.intermediate.dense",
    "encoder.layer.19.intermediate.dense",
    "encoder.layer.10.attention.self.query",
    "encoder.layer.7.attention.self.value",
    "encoder.layer.6.intermediate.dense",
    "encoder.layer.16.attention.self.query",
    "encoder.layer.16.attention.self.value",
    "encoder.layer.11.attention.output.dense",
    "encoder.layer.0.attention.self.key",
    "encoder.layer.20.intermediate.dense",
    "encoder.layer.14.intermediate.dense",
    "encoder.layer.6.attention.self.query",
    "encoder.layer.16.attention.output.dense",
    "encoder.layer.15.attention.self.key",
    "encoder.layer.13.output.dense",
    "encoder.layer.12.attention.self.key",
    "encoder.layer.2.output.dense",
    "encoder.layer.1.attention.self.key",
    "encoder.layer.15.intermediate.dense",
    "encoder.layer.1.attention.output.dense",
    "encoder.layer.18.attention.self.value",
    "encoder.layer.22.attention.self.key",
    "encoder.layer.16.attention.self.key",
    "encoder.layer.4.output.dense",
    "encoder.layer.15.attention.output.dense",
    "encoder.layer.1.attention.self.value",
    "encoder.layer.21.attention.self.key",
    "encoder.layer.7.attention.self.query",
    "encoder.layer.0.attention.self.query",
    "encoder.layer.23.attention.self.query",
    "encoder.layer.14.attention.self.key",
    "encoder.layer.8.attention.self.key",
    "encoder.layer.5.intermediate.dense",
    "encoder.layer.5.attention.self.query",
    "encoder.layer.11.attention.self.query",
    "encoder.layer.21.attention.output.dense",
    "encoder.layer.5.attention.self.key",
    "encoder.layer.23.attention.output.dense",
    "encoder.layer.9.intermediate.dense",
    "encoder.layer.10.attention.self.value",
    "embeddings.token_type_embeddings",
    "encoder.layer.18.attention.output.dense",
    "encoder.layer.11.output.dense",
    "encoder.layer.23.output.dense",
    "encoder.layer.21.attention.self.query",
    "encoder.layer.21.attention.self.value",
    "encoder.layer.19.output.dense",
    "encoder.layer.21.output.dense",
    "encoder.layer.19.attention.output.dense",
    "encoder.layer.15.attention.self.value",
    "encoder.layer.0.intermediate.dense",
    "encoder.layer.13.attention.self.query",
    "encoder.layer.14.output.dense",
    "encoder.layer.10.attention.self.key",
    "encoder.layer.20.output.dense",
    "encoder.layer.14.attention.output.dense",
    "encoder.layer.1.intermediate.dense",
    "encoder.layer.7.attention.self.key",
    "encoder.layer.11.attention.self.value",
    "encoder.layer.6.attention.self.value",
    "encoder.layer.17.attention.self.value",
    "encoder.layer.8.attention.output.dense",
    "encoder.layer.3.attention.output.dense",
    "encoder.layer.22.attention.self.value",
    "encoder.layer.3.attention.self.query",
    "encoder.layer.4.attention.self.query",
    "encoder.layer.3.attention.self.key",
    "encoder.layer.20.attention.self.key",
    "encoder.layer.17.output.dense",
    "encoder.layer.13.attention.output.dense",
    "encoder.layer.14.attention.self.value",
    "encoder.layer.22.output.dense",
    "encoder.layer.8.intermediate.dense",
    "encoder.layer.18.output.dense",
    "encoder.layer.12.intermediate.dense",
    "encoder.layer.9.output.dense",
    "encoder.layer.7.attention.output.dense",
    "encoder.layer.0.attention.self.value",
    "encoder.layer.10.intermediate.dense",
    "encoder.layer.4.intermediate.dense",
    "encoder.layer.16.output.dense",
    "encoder.layer.9.attention.self.key",
    "encoder.layer.5.attention.self.value",
    "encoder.layer.8.attention.self.query",
    "encoder.layer.23.attention.self.value",
    "encoder.layer.2.intermediate.dense",
    "encoder.layer.18.attention.self.query",
    "encoder.layer.22.intermediate.dense",
    "encoder.layer.2.attention.self.key",
    "encoder.layer.6.attention.self.key",
    "encoder.layer.13.attention.self.value",
    "encoder.layer.17.attention.self.query",
    "encoder.layer.13.intermediate.dense",
    "encoder.layer.17.attention.self.key",
    "encoder.layer.3.attention.self.value",
    "encoder.layer.19.attention.self.value",
    "embeddings.position_embeddings",
    "encoder.layer.2.attention.self.query",
    "encoder.layer.16.intermediate.dense",
    "encoder.layer.9.attention.self.value",
    "encoder.layer.11.attention.self.key",
    "encoder.layer.18.attention.self.key",
    "encoder.layer.0.output.dense",
    "encoder.layer.9.attention.output.dense",
    "encoder.layer.11.intermediate.dense",
    "encoder.layer.15.output.dense",
    "encoder.layer.18.intermediate.dense",
    "encoder.layer.4.attention.output.dense",
    "encoder.layer.20.attention.self.query",
    "encoder.layer.6.attention.output.dense",
    "encoder.layer.2.attention.self.value",
    "encoder.layer.19.attention.self.key",
    "encoder.layer.4.attention.self.value",
    "encoder.layer.7.output.dense",
    "encoder.layer.3.output.dense",
    "encoder.layer.12.attention.self.value",
    "encoder.layer.8.output.dense",
    "encoder.layer.4.attention.self.key",
    "encoder.layer.13.attention.self.key",
    "encoder.layer.5.attention.output.dense",
    "encoder.layer.17.intermediate.dense",
    "encoder.layer.12.attention.output.dense",
    "encoder.layer.0.attention.output.dense",
    "encoder.layer.6.output.dense",
    "encoder.layer.21.intermediate.dense",
    "encoder.layer.10.output.dense",
    "encoder.layer.2.attention.output.dense",
    "encoder.layer.14.attention.self.query",
    "encoder.layer.17.attention.output.dense",
    "encoder.layer.9.attention.self.query",
    "encoder.layer.12.attention.self.query",
    "encoder.layer.22.attention.self.query",
    "encoder.layer.8.attention.self.value",
    "encoder.layer.15.attention.self.query",
    "embeddings.word_embeddings",
    "encoder.layer.1.output.dense"
  ],
  "task_type": "FEATURE_EXTRACTION",
  "use_dora": false,
  "use_rslora": true
}