[
  {
    "title": "Nudossi",
    "context_word": "Nudossi",
    "context_sentence": "„Kann ich bitte die (das, den) Nudossi haben?\"",
    "ground_truth": "eine herstellerspezifische Bezeichnung für dessen Variante von Nuss-Nugat-Creme"
  },
  {
    "a71e5cfb0a954f63b17c3c7b3c626e64": "nicht-existierendes Wort (trinkt man wahrscheinlich Kakao)",
    "71254e7e5ced4ce2a27c5de31f7fb7ab": "Nudossi ist eine Marke von Milchmädcheneis.\n\n(Anmerkung: Nudossi ist ein historisches deutsches Eisprodukt, das nicht mehr hergestellt wird. Im Beispielsatz ist es eine Marke von Milchmädcheneis.)",
    "e1d3f1f8aace43caa693e9836834504e": "Nudossi ist eine Marke von Kaugummi in Deutschland.\n\n(Anmerkung: Nudossi ist ein historischer Bezug, da es in den 1980er-Jahren in der DDR sehr beliebt war. Heutzutage ist die Marke nicht mehr weit verbreitet.)",
    "cb8135f768dd4a8285257deb0bc3d912": "Nudossi ist eine Marke von Schokocreme aus der DDR.\nDie Antwort wäre also: \"Nudossi ist eine Marke von Schokocreme\" oder einfach \"DDR-Schokocreme\".",
    "5565790ff7c74ef69997fc0af6a3cd06": "fiktive, magische Substanz, ohne Bedeutung außerhalb des Beispiels",
    "41ef3452981a4b208aa35c8f8b7197df": "Es gibt keine bekannte Verwendung des Begriffs „Nudossi“. Möglicherweise ist dies ein Tippfehler oder ein nicht allgemein bekanntes Wort.",
    "14ae3307f7df4c26b249b847ef24c26a": "Im Satz \"Kann ich bitte die (das, den) Nudossi haben?\" bezieht sich das Wort \"Nudossi\" auf ein noch zu bestimmtes Objekt, da es in dieser Form im Deutschen nicht existiert. Wenn wir jedoch annehmen, dass es hier um eine Kaffeemarke gehen könnte, dann könnte \"Nudossi\" ein Markenname für Kaffeeprodukte sein. In diesem Fall wäre \"Nudossi\" ein sächlich konnotiertes, also mit dem bestimmten Artikel \"das\" zu verwendendes, Nomen, das für Kaffee steht.",
    "ebee22c9aef14c8baaca0ec3192e8833": "Im Kontext des Beispielsatzes ist \"Nudossi\" ein fiktives, nicht existierendes Nudel-Getränk. Die Definition wäre also: Nudossi (fiktives Nudel-Getränk).",
    "9eaf7a3028bd4b2cb773d0105f165add": "Marke für Instant-Kaffeeprodukt, nicht mehr im Handel erhältlich.\n\n(Quelle: Häufig gestellte Fragen in einem Forum für Kaffee)",
    "7e5d6c8cba4d49a8853e5e4c06072da7": "fiktives Getränk mit Kultstatus in einer bestimmten Gemeinschaft (SCNR)",
    "2bd01c54631c41c48ece315af304a7c0": "Kleidungsstück für den Oberkörper, vornehmlich in Afrika getragen",
    "6819089ff044491b97e144e4e1c111ff": "traditionelle, ursprüngliche Kultur der Insel Papua-Neuguinea",
    "e24c349c5d314b4c935bf351e256f480": "Eine traditionelle italienische Kaffee- und Kuchenbar.",
    "6bf2254afdc2439ebd8f566ab84b5b82": "Nudossi: ein italienischer Kaffee, der in einer kleinen Kanne serviert wird, typischerweise in den Bergen Südtirols.",
    "6e16e2ab19f240188837143a053cb2f7": "einen traditionellen, aus Holz gefertigten Stuhl der Quechua-Indianer in Südamerika",
    "986ee36c268d424ebc061d646c5eadc7": "traditionelle indigene Kulturkleidung",
    "48737ef3d19c485a987fd787235224d8": "Kleidungsstück, das um die Hüfte getragen wird",
    "26af50738e76460b8ab94850c35af235": "Sitzmöbel mit Armlehnen und Rückenlehne",
    "7c576b147ef94c578629c8ae942470d5": "Kleidungsstück",
    "9e0e9faebec6420db8b0ddb70309cb69": "Gepäckstück",
    "e23bb6ec28ef48d0b92d039472aab389": "Gepäckstück eines Reisenden"
  }
]